#ifndef _APP_BUZZER_H
#define _APP_BUZZER_H

#include "stdint.h"
#include "stdbool.h"

/* ==================================================== *
 * 1. 单次发声 API (按键提示音调用这个)
 * ==================================================== */
void App_Buzzer_Beep(uint32_t ms);

/* ==================================================== *
 * 2. 持续报警 API (故障中心调用这个)
 * ==================================================== */
void App_Buzzer_Set_Alarm(bool enable);

/* ==================================================== *
 * 3. 蜂鸣器后台守护任务 (放在 main 的 while(1) 中高频调用)
 * ==================================================== */
void App_Buzzer_Task(void);

#endif




