/**
 ******************************************************************************
 * @file    Mid_Adc.c
 * @author  Letian
 * @date    [20260317]
 * @brief   ADC 物理量换算中间件 (MID)
 * @note    负责读取底层 BSP 的 ADC 原始机器码，并根据硬件电路的偏置与增益，
 * 换算为实际的电压 (V) 和电流 (A/uA) 等物理量，供 APP 层调用。
 ******************************************************************************
 */

#include "Mid_Adc.h"
#include "Bsp_Adc.h"

/* ========================================================================== *
 * 【MID 层】高压侧传感器数据换算
 * ========================================================================== */

/**
 * @brief  获取高压母线电压值
 * @retval float 实际电压值，单位：V
 */
float Mid_Get_Hv_V(void)
{
    int   temp_data;
    float HV_V;

    /* 1. 提取交流量并消除 1.65V (2048) 的直流偏置 */
    temp_data = (2048 - Bsp_Get_Hv_Raw_Data()) * 2;

    /* 2. 根据硬件分压比进行物理量换算
     * 理论推导公式: HV_V = (temp_data / 4096) * 3.3f * 2 * 501 / 0.4f
     * 预结算常数  : 1.00909423828125f
     */
    HV_V = temp_data * 1.00909423828125f;

    return HV_V;
}

/**
 * @brief  获取高压母线电流
 * @retval float 实际电流值，单位：uA
 */
float Mid_Get_Hi_uA(void)
{
    int   temp_data;
    float HV_I;

    /* 1. 提取交流量并消除 1.65V (2048) 的直流偏置 */
    temp_data = (2048 - Bsp_Get_Hi_Raw_Data()) * 2;

    /* 2. 根据硬件采样电阻和放大倍数进行物理量换算
     * 理论推导公式: HV_I = (temp_data / 4096) * 3.3f / 8 / 10 * 1000
     * 预结算常数  : 0.01007080078125f (已补充单精度 f 后缀加速运算)
     */
    HV_I = temp_data * 0.01007080078125f;

    return HV_I;
}


/* ========================================================================== *
 * 【MID 层】低压侧传感器数据换算
 * ========================================================================== */

/**
 * @brief  获取低压 DC 电流
 * @retval float 实际电流值，单位：A
 */
float Mid_Get_Dc_I_A(void)
{
    float Dc_I_A;

    /* 根据硬件采样电阻和放大倍数进行物理量换算
     * 理论推导公式: Dc_I_A = (ADC_RAW / 4096) * 3.3f / 200 / 0.005f
     * 预结算常数  : 0.0008056640625f
     */
    Dc_I_A = Bsp_Get_Dc_I_Raw_Data() * 0.0008056640625f;

    return Dc_I_A;
}
